## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_firestore_database.this will be created
  + resource "google_firestore_database" "this" {
      + app_engine_integration_mode       = (known after apply)
      + concurrency_mode                  = (known after apply)
      + create_time                       = (known after apply)
      + delete_protection_state           = (known after apply)
      + deletion_policy                   = "ABANDON"
      + earliest_version_time             = (known after apply)
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + key_prefix                        = (known after apply)
      + location_id                       = "europe-west1"
      + name                              = "(default)"
      + point_in_time_recovery_enablement = "POINT_IN_TIME_RECOVERY_DISABLED"
      + project                           = "zeni-su-o1y9gx"
      + type                              = "FIRESTORE_NATIVE"
      + uid                               = (known after apply)
      + update_time                       = (known after apply)
      + version_retention_period          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>